#pragma once
//______________________________//
//|プレイヤ                     |//
//|履歴：2018/03/23横田	       |//
//|____________________________|//
#include "OGSystem\OGsystem.h"
#include "Object\Object.h"

class Player :public Object
{
public:
	Texture playerimg;
	std::string fileName = "player.png";
	bool hitcheck;

	void Initialize();
	void UpDate();
	void Render();
	void Finalize();
	//☆☆☆☆//-----------------------------------------------------------------------------
	//追加変数//-----------------------------------------------------------------------------
	//☆☆☆☆//-----------------------------------------------------------------------------

	//X方向の移動スピード
	float speed;
	//ジャンプの初速度
	float jump_speed;
	//ジャンプの加速度
	float jump_accel;
	//ジャンプ状態
	bool jumpFlag;
	//着地の判定を使う
	float MAX_Y;
	//地面にいるときのY座標
	float ground_y = MAX_Y - 2;

	//☆☆☆☆//-----------------------------------------------------------------------------
	//クラスのメンバ関数
	//☆☆☆☆//-----------------------------------------------------------------------------
	//ジャンプのプロトタイプ宣言
	void JumpMove(Vec2& e_);
};


